<?php

return [
    "actions" => [
        "page" => [
            "add" => "اضافة علامة مرجعية",
            "remove" => "حذف العلامة المرجعية",
            "notification" => [
                "add" => [
                    "title" => "العلامة المرجعية",
                    "body" => "تمت إضافة العلامة المرجعية بنجاح"
                ],
                "remove" => [
                    "title" => "العلامة المرجعية",
                    "body" => "تم حذف العلامة المرجعية بنجاح"
                ]
            ],
            "modal" => [
                "add" => "اضافة علامة مرجعية",
                "remove" => "حذف العلامة المرجعية"
            ]
        ],
        "table" => [
            "add" => "اضافة العلامة المرجعية",
            "remove" => "حذف العلامة المرجعية",
            "modal" => [
                "add" => "اضافة العلامة المرجعية",
                "remove" => "حذف العلامة المرجعية"
            ]
        ],
        "bulk" => [
            "add" => "اضافة العلامات المرجعية",
            "remove" => "مسح العلامات المرجعية",
            "modal" => [
                "add" => "اضافة العلامات المرجعية المحددة",
                "remove" => "مسح العلامات المرجعية المحددة"
            ]
        ],
        "types" => [
            "form" => [
                "type" => "نوع العلامة المرجعية",
                "bookmark" => "علامة مرجعية"
            ]
        ]
    ],
    "page" => [
        "title" => "العلامات المرجعية",
        "table" => [
            "name" => "الاسم",
            "url" => "العلامة المرجعية",
            "actions" => [
                "remove" => [
                    "lable" => "حذف العلامة المرجعية",
                    "modal" => "حذف العلامة المرجعية",
                    "notification" => [
                        "title" => "العلامة المرجعية",
                        "body" => "تم حذف العلامة المرجعية بنجاح"
                    ]
                ],
                "bulk" => [
                    "label" => "حذف العلامات المرجعية",
                    "modal" => "مسح العلامات المرجعية",
                    "notification" => [
                        "title" => "العلامات المرجعية",
                        "body" => "تم مسح العلامات المرجعية بنجاح"
                    ]
                ]
            ]
        ],
        "actions" => [
            "edit" =>[
                "label" => "تعديل",
                "modal" => "تعديل العلامة المرجعية",
                "notification" => [
                    "title" => "العلامة المرجعية",
                    "body" => "تم تعديل العلامة المرجعية بنجاح"
                ],
                "form" => [
                    "name" => "الاسم",
                    "color" => "اللون",
                    "icon" => "الايقونة",
                    "is_private" => "خاص",
                ]
            ],
            "delete"=> [
                "label" => "حذف",
                "modal" => "حذف العلامة المرجعية",
                "notification" => [
                    "title" => "العلامة المرجعية",
                    "body" => "تم حذف العلامة المرجعية بنجاح"
                ]
            ]
        ]
    ],
    "components" => [
        "total" => "مجموع العلامات المرجعية",
        "folders" => "المجلدات",
    ],
    "livewire" => [
        "create" => [
            "label" => "انشاء مجموعة",
            "modal" => "انشاء مجموعة",
            "form" => [
                "name" => "الاسم",
            ],
            "notification" => [
                "title" => "العلامة المرجعية",
                "body" => "تم انشاء العلامة المرجعية بنجاح"
            ]
        ]
    ]
];
